<template>
  <div>
    <p id="banner">用户使用协议</p>
    <div id="content">
      <h4>一、特别提示</h4>
      <p>唯ID用户使用协议（下简称本协议）系由用户与深圳市友全科技有限公司（下简称友全科技）之间就友全科技提供的唯ID的手机账号（下简称唯ID验证）所订立的权利义务规范，同时本协议亦适用于任何有关友全科技服务的后期的更新或升级。本协议是用户接受友全科技所提供的账号和认证服务时所适用的通用条款，用户应当阅读并遵守本协议、使用说明及相关附件规定。用户选择接受服务时，应务必审慎阅读、充分理解各条款内容。除非用户已阅读并接受本协议所有条款，否则无权安装、登录、使用友全科技提供的账号和认证服务。用户的下载、安装、注册、登录、使用等行为均视为已阅读并同意本协议约束。</p>
      <h4>二、 协议范围</h4>
      <p>本协议内容同时包括友全科技可能不断发布或提示用户的关于账号和认证服务的相关协议、使用规则、风险告知、服务公告等内容。上述内容一经正式发布，即视为本协议不可分割的组成部分，用户选择接受账号和认证服务时应予以遵守。</p>
      <h4>三、 服务说明</h4>
      <p>1. 友全科技为唯ID账号和认证服务的所有者及经营者，唯ID账号和认证服务的具体内容由友全科技根据实际情况提供，主要为手机账号、专有云IDaaS解决方案等。</p>
      <p>2. 用户应理解并同意：当用户网站遭受如DDoS等攻击时，会严重占用验证流量并在攻击到达一定的程度时，账号和认证服务会出现无法加载等异常现象。届时，友全科技将会提供相关的付费定制防护服务来升级产品，如果用户不愿使用相关付费服务，友全科技有权终止所有服务。</p>
      <p>3. 友全科技提供账号和认证服务时，可能会针对部分服务向用户收取一定的费用。在此情况下，友全科技将会在相关页面作出提示。如用户不同意支付该等费用,则可不接受相关的服务。</p>
      <p>4. 如用户选择接受有偿服务项目时，应通过友全科技提供的支付方式（现为支付宝）进行支付。</p>
      <p>5. 唯ID账号和认证服务为互联网在线SaaS服务，在使用该服务的过程中，可能受多种因素影响不可避免的存在某种使用风险，用户应具备软件运行或接受相应账号和认证服务所需的条件，用户必须保证有权使用其运行所需操作系统。在适用法律允许的最大范围内，友全科技在任何情况下不就用户因使用或不能使用服务所发生的特殊的、意外的、直接的或间接的侵权或遭致损失承担赔偿责任。</p>
      <h4>四、 信息保护</h4>
      <p>1.友全科技将采取合理措施保护用户的信息和数据，除法律法规规定的情形外，对用户接受唯ID账号和认证服务所产生的数据和信息严格保密，未经用户许可不向第三方披露或公开。但下列情形不适用本保密条款</p>
      <p>1.1 非因友全科技的过错造成的信息披露或公开;</p>
      <p>1.2 非因使用或接受友全科技的服务被他人知悉的数据或信息；</p>
      <p>1.3 因法律法规的规定，需要向法院或其他国家有权机关的披露的行为。</p>
      <p>2. 本软件不含有任何旨在破坏用户计算机数据和获取用户隐私信息的恶意代码。</p>
      <h4>五、 授权范围</h4>
      <p>1. 用户可以为非商业目的在计算机或其他掌上终端上安装、使用、显示、运行验证软件，并接受唯ID账号和认证服务。</p>
      <p>2. 用户不得为商业运营目的安装、使用、运行验证软件，不可以对验证软件或者软件运行过程中释放到任何终端内存中的数据及本软件运行过程中客户端与服务器端的交互数据进行复制、更改、修改、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非经授权的第三方工具/服务接入本软件和相关系统。</p>
      <p>3. 即使用户使用增值服务(如界面定制服务)，唯ID产品及服务的所有权及经营权仍归友全科技所有。</p>
      <p>4. 用户可以非商业性地下载、安装、复制和散发唯ID验证软件。如果需要进行商业性的销售、复制和散发，例如软件预装和捆绑，必须获得友全科技的书面授权和许可。</p>
      <p>5. 权利保留：本条款及本协议其他条款未明示授权的其他一切权利仍由友全科技保留，用户使用其他权利时须另外取得友全科技的书面同意。友全科技未行使前述任何权利，并不表示对该项权利的放弃。</p>
      <h4>六、禁止行为</h4>
      <p>1. 使用唯ID软件或接受账号和认证服务过程中，用户必须遵守国家有关法律和政策等，维护国家利益，保护国家安全，并遵守本协议。</p>
      <p>2. 除非法律、法规允许或本协议书面许可的前提下，用户在接受友全科技账号和认证服务过程中，不得实施如下行为（包括但不限于）：</p>
      <p>2.1 删除验证软件及其他副本上一切关于著作权的信息；</p>
      <p>2.2 对验证软件进行反向工程，如反汇编、反编译，或者以其他方式尝试发现验证软件的源代码等；</p>
      <p>2.3 修改、破坏验证软件原状；</p>
      <p>2.4 进行任何危害网络安全的行为，包括但不限于：使用未经许可的数据或进入未经许可的服务器/帐户；未经允许进入公众网络或者他人操作系统并删除、修改、增加、复制存储信息；</p>
      <p>2.5 未经许可企图探查、扫描、测试验证系统或网络的弱点或其它实施破坏网络安全的行为；企图干涉、破坏验证软件系统或网站的正常运行，故意传播恶意程序或病毒以及其他破坏干扰正常网络信息服务的行为；伪造TCP/IP数据包名称或部分名称；</p>
      <p>2.6 未经唯ID验证书面同意，擅自实施包括但不限于下列行为：使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版，建立镜像站点、借助验证软件发展与之有关的衍生产品、作品、服务、插件、外挂、兼容、互联等；</p>
      <p>2.7 利用验证软件发表、传送、传播、储存侵害他人知识产权、商业秘密权等合法权利的内容；</p>
      <p>2.8 利用验证软件批量发表、传送、传播广告信息及垃圾信息；</p>
      <p>2.9 传送、散布或以其他方式实现侵犯第三人权利的图像、相片、软件、信息或其他资料文件，包括但不限于著作权、商标法、肖像权、商业信息等，除非用户已征得相关权利人的书面许可；</p>
      <p>2.10 通过修改或伪造软件运行中的指令、数据、数据包，增加、删减、变动软件的功能或运行效果，或将用于上述用途的软件通过信息网络及其他方式向公众传播或者运营；</p>
      <p>2.11 在未经友全科技书面明确授权的前提下，出售、出租、出借、散布、转移或转授权软件和服务或相关的链接或从使用软件和服务或软件和服务的条款中获利，无论以上使用是否为直接经济或金钱收益；</p>
      <p>2.12 其他以任何不合法的方式、或为任何非法目的、或以任何与本协议不一致的方式使用验证软件和友全科技提供的其他服务；</p>
      <p>2.13 其他法律法规或相关国家政策禁止或未经友全科技书面授权的行为。</p>
      <p>3.用户若违反上述规定，友全科技有权采取终止、完全或部分中止、限制用户使用唯ID验证的功能。如因用户上述行为，导致或产生第三方主张的任何索赔、要求或损失，由用户自行承担；由此造成友全科技损失的，友全科技有权追偿。</p>
      <h4>七、使用规范</h4>
      <p>1. 用户在接受唯ID账号和认证服务时，必须遵守中华人民共和国相关法律法规的规定，用户应同意将不会利用唯ID产品或服务进行任何违法或不正当的行为，包括但不限于下列行为：</p>
      <p>1.1 上传、下载、张贴或以其他方式提供任何非法、有害、胁迫、骚扰、侵权、中伤、粗俗、猥亵、诽谤、淫秽、暴力、侵害他人隐私、种族歧视或其他违法的信息，包括但不限于资讯、资料、文字、照片、图形、信息或其他资料；</p>
      <p>1.2 以任何方式危害未成年人；</p>
      <p>1.3 冒充任何人或机构，或以虚伪不实的方式谎称或使人误认为与任何人或任何机构有关；</p>
      <p>1.4 伪造标题或以其他方式操控识别资料，使他人产生误解；</p>
      <p>1.5 上传、张贴或以其他方式传送无权传送的内容；</p>
      <p>1.6 侵犯他人著作权或其他知识产权，或违反保密、雇佣或不披露协议披露他人商业秘密或保密信息；</p>
      <p>1.7 张贴、发送或以其他方式提供任何未经权利人许可或授权的电子信息、广告、促销资料等，包括但不限于大批量的商业广告和信息公告；</p>
      <p>1.8 干扰或破坏有关服务，或与有关服务连接的任何服务器或网络，或与有关服务连接之网络的任何政策、要求或规定；</p>
      <p>1.9 采集并存储涉或以其他方式侵犯其他用户的个人信息，无论该行为是否用于何种目的；</p>
      <p>1.10 故意或非故意违反任何相关的中国法律、法规、政策、规章、条例等其他具有法律效力的规范性文件。</p>
      <p>2. 用户对以其账号发生的或通过其账号发生的一切活动和事件，包括但不限于用户上传的图片以及由此产生的任何结果，自行承担全部法律责任。</p>
      <h4>八、违约责任</h4>
      <p>1. 用户违反本协议任一条款约定，均视为违约。友全科技有权选择采取终止、完全或部分中止、限制用户使用唯ID验证的功能。</p>
      <p>2. 用户理解并同意，因用户违反本协议或相关服务条款的规定，导致或产生第三方主张的任何索赔、要求或损失，由用户独立承担责任。由此导致友全科技遭受损失的，用户应当予以赔偿。</p>
      <p>3. 友全科技拥有唯ID的著作权，该权利受《中华人民共和国著作权法》、《计算机软件保护条例》等中国法律、法规及相关国际公约的保护，任何未经授权而擅自修改、复制、发行、出租、传播、翻译、反向编译或反向工程本软件程序的全部或部分，均属于侵权行为，友全科技保留依法追究其法律责任的权利。</p>
      <h4>九、协议终止</h4>
      <p>如果用户违反本协议项下任一条款约定的，则本协议自动终止，友全科技无需另行通知用户；本协议终止后，友全科技有权立即停止用户的唯ID账号和认证服务，并将服务过程中的相关信息、资料等彻底删除。</p>
      <h4>十、 通知送达</h4>
      <p>友全科技如提示某项服务收费或发布使用规则或风险告知或协议修订或系统升级等相关事项，将在用户使用的web界面或服务平台发布有关事项的公告，自公告发布之日起。届时，用户在选择接受服务时，视为已通知送达用户，友全科技无需另行通知。</p>
      <h4>十一、协议修改</h4>
      <p>1. 友全科技有权随时修订本协议的任何条款，一旦本协议的内容发生变动，友全科技将会在唯ID网站上公布修订后的协议内容。同时，友全科技也可选择其他合理方式（比如系统通知）向用户通知修订内容。</p>
      <p>2. 用户不同意友全科技对本协议的修订内容，应停止下载、安装、注册、登录、使用唯ID验证软件的行为，友全科技亦有权终止双方的服务。</p>
      <p>3. 用户继续接受唯ID账号和认证服务的，则视为用户同意对本协议相关条款所做的修订。</p>
      <h4>十二、其他事项</h4>
      <p>1. 友全科技有可能针对本协议某项服务添加相关特别约定或服务协议。届时，用户接受该项服务或产品的前提为同意该项服务所附带的所有规范性文件，包括但不限于本服务使用协议及专项服务协议等。</p>
      <p>2. 本协议构成双方对本协议之约定事项及其他有关事宜的完整协议，除本协议规定之外，未赋予本协议各方其他权利。</p>
      <p>3. 如本协议中的任何条款无论因何种原因完全或部分无效或不具有约束力，本协议的其余条款仍应有效，对双方具有约束力。</p>
      <p>4. 本协议签订地为中华人民共和国广东省深圳市宝安区。</p>
      <p>5. 本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国法律，争议管辖地为本协议签订地有管辖权的人民法院。</p>
      <p>6. 本服务协议最终解释权归友全科技所有。</p>
      <p style="margin-top: 40px">唯ID</p>
      <p>深圳市友全科技有限公司</p>
    </div>
  </div>
</template>

<script>
export default {
  data () {
    return {
    }
  }
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
  #content {
    padding: 40px 0;
    width: 980px;
    margin: 0 auto;
  }
  #banner {
    background-color: #f7f8f9;
    color: #303133;
  }
</style>
