import React from "react";

export default function() {
    return (
        <>
            <h1>简介</h1>
            <h2>前言</h2>
            <p>
                唯ID
                IAM是企业级的统一用户权限平台，有用户管理、组织机构管理、应用管理、权限管理、角色管理、统计数据、审计日志等7大模块，可以满足各类企业、政府机构等最复杂的IAM需求。
            </p>
            <h2>你可能不需要使用唯ID IAM（的全部功能）</h2>
            <p>
                正因为唯ID IAM是完善的IDaaS解决方案，功能模块众多，所以刚接触的开发者可能觉得
                "眼花缭乱"。
            </p>
            <p>
                按我们的统计，现有接入唯ID的应用中超过一半都是面向公众的普通应用，同时规模并不大，这个时候，你并不需要
                "为了用而用"。我们推荐 <b>按需渐进式引入</b>，比如：
            </p>
            <ul>
                <li>
                    你的网站规模逐渐扩大，开始有多种用户角色，需要管理不同角色的权限时，就可以用上唯ID的权限和角色管理模块。
                </li>
                <li>
                    你的应用是政府机构的信息系统，虽然规模不大，但人员构成复杂，需要按组织机构统一管理，就可以用上唯ID的组织机构管理模块。
                </li>
            </ul>
            <p>如果你的项目刚起步，没有这些需求，你完全可以对用不上的功能模块 "视而不见"。</p>
            <h2>获取详尽的开发文档</h2>
            <p>
                如果你确定自己的项目需要用到唯ID
                IAM的高级功能模块，那么，你也应该是我们的重点客户，欢迎联系客户经理（官网左下角），获取详尽的开发文档。
            </p>
        </>
    );
}
